[
    {
        "title": "yvguo",
        "occupation": "Calisthenics Content Creator",
        "occupation_about": "New York City Calisthenics Enjoyer",
        "image": "/images/resource_images/yvguo-landing.png",
        "image_about": "/images/resource_images/yvguo-about.png",
        "highlighted_about_description": "<span class='font-bold'>skills tutorials</span> and comprehensive <span class='font-bold'>strength-building routines</span>. His focus on <span class='font-bold'>progressions</span> has made him popular in the calisthenics community.",
        "about_description": "yvguo is renowned for his in-depth tutorials on a wide variety of calisthenics skills, ranging from beginner to advanced movements. He specializes in providing detailed progressions, ensuring that athletes of all levels can follow his routines. He also shares insights into optimizing strength-building through bodyweight exercises, often incorporating cutting-edge training methodologies. His ability to break down complex moves into accessible steps has built him a large following online.",
        "color": "blue",
        "description": "Self-taught fitness influencer who creates accessible content for beginners, focusing on calisthenics. His YouTube videos break down bodyweight exercises into simple, easy-to-follow routines that promote strength building using minimal equipment",
        "videos": [
            {
                "title": "How to Build Stronger Wrists with Calisthenics (and Prevent Injuries)",
                "url": "https://www.youtube.com/embed/5edL1aEBe4Y",
                "description": "Learn how to build stronger wrists for calisthenics and prevent injuries.",
                "video_summary": [
                    [
                        "Introduction to Wrist Safety in Calisthenics",
                        [
                            "Importance of Wrist Safety:",
                            "The wrist is one of the most injury-prone joints in calisthenics due to its natural weakness in disadvantageous angles (e.g., 90° flexion in floor movements).",
                            "Common Mistakes:",
                            "Many beginners neglect wrist conditioning, leading to strains and overuse injuries. Injuries often occur from overstepping limits without proper preparation or recovery.",
                            "Personal Experience:",
                            "The video creator experienced injuries when starting calisthenics due to lack of awareness around wrist safety."
                        ]
                    ],
                    [
                        "Wrist Mobility and Strength Building Routine",
                        [
                            "Warm-up Phase:",
                            "Wrist rotations and ROM exercises to loosen joints and increase mobility.",
                            "Dynamic Stretching:",
                            "Stretch wrists with palms up and down, gradually increasing range of motion without holding stretches.",
                            "Mobility Drills:",
                            "Gentle pulsing through ROM with palms facing down and up, and wrist deviation drills like wrist rolls.",
                            "Strengthening Exercises:",
                            "Finger pushes, push-up progressions, wrist deviation strength exercises, and fingertip holds."
                        ]
                    ],
                    [
                        "Advanced Wrist Strengthening",
                        [
                            "Dead Hangs:",
                            "A fundamental grip-strength exercise, with progressions to fingertip hangs or one-arm hangs.",
                            "False Grip:",
                            "Advanced wrist flexion exercise, requiring proper form and gradual progression from low-bar support to pull-ups."
                        ]
                    ],
                    [
                        "Training Frequency & Recovery",
                        [
                            "Daily Mobility Work:",
                            "Wrist mobility exercises can be performed daily without fatigue.",
                            "Strength Training Rest:",
                            "Strength exercises should be rested like any muscle group and performed 2-3 sets during regular training days."
                        ]
                    ],
                    [
                        "Conclusion",
                        [
                            "Takeaways:",
                            "Consistent practice and gradual progression in wrist conditioning prevent injuries and lead to long-term gains."
                        ]
                    ]
                ]
            },
            {
                "title": "Invincible Shoulders Tutorial | Shoulder Mechanics, Mobility and Prehab",
                "url": "https://www.youtube.com/embed/IekGVkQNHOw",
                "description": "Shoulder mechanics, mobility, and prehab tips for calisthenics athletes.",
                "video_summary": [
                    [
                        "Introduction to Shoulder Injury Prevention",
                        [
                            "Purpose of the Routine:",
                            "This injury prevention routine is specifically designed for calisthenics athletes to protect shoulder joints during intense training.",
                            "Common Causes of Injury:",
                            "Injuries often result from lack of strength or preparation, especially in deeper ranges of motion."
                        ]
                    ],
                    [
                        "Understanding Shoulder Mobility",
                        [
                            "Strength and Mobility Relationship:",
                            "Strength cannot exist without mobility, and mobility cannot exist without flexibility. To build deep range strength, one must first be flexible and mobile in those ranges.",
                            "Impact of Training on Muscle Length:",
                            "Prolonged resistance training can shorten muscles, so it’s important to stretch consistently."
                        ]
                    ],
                    [
                        "Key Movements in Shoulder Mobility",
                        [
                            "Six Shoulder Movements:",
                            "The shoulder performs six basic movements: flexion, extension, abduction, adduction, internal rotation, and external rotation.",
                            "Importance of Rotator Cuff:",
                            "Healthy, mobile shoulders require training all the muscles around the shoulder, especially the rotator cuff."
                        ]
                    ],
                    [
                        "Kinetic Chains of the Shoulder",
                        [
                            "Anterior Kinetic Chain:",
                            "This includes muscles like the chest, anterior deltoid, biceps, and forearms, which work together in movements like the planche.",
                            "Posterior Kinetic Chain:",
                            "Muscles in the back such as lats, rear delts, triceps, and forearms, crucial for balance in shoulder mobility."
                        ]
                    ],
                    [
                        "Mobility Exercises",
                        [
                            "Shoulder Dislocates:",
                            "One of the best all-encompassing mobility exercises, using a stick or resistance band to pass the arms over the head.",
                            "Wall and Seated Stretches:",
                            "Wall stretches for external rotation and seated floor stretches for shoulder extension are key for conditioning."
                        ]
                    ],
                    [
                        "Loaded Mobility Work",
                        [
                            "PNF Stretching with Rings:",
                            "Using rings to stretch the shoulders and activate kinetic chains with progressive movements.",
                            "Resistance Band Exercises:",
                            "Light resistance bands are used to strengthen the rotator cuff, focusing on internal and external rotations."
                        ]
                    ],
                    [
                        "Conclusion",
                        [
                            "Key Takeaways:",
                            "Progressive overload in mobility and strength training is essential for preventing injuries and improving performance in calisthenics."
                        ]
                    ]
                ]
            },
            {
                "title": "Steel Elbows Tutorial (Mechanics, Conditioning and Injury Prevention)",
                "url": "https://www.youtube.com/embed/BrsILqXS_3Y",
                "description": "Learn about elbow mechanics, conditioning, and injury prevention for calisthenics.",
                "video_summary": [
                    [
                        "Introduction to Elbow Injury Prevention",
                        [
                            "Purpose of the Routine:",
                            "This injury prevention routine is designed for calisthenics athletes to protect the elbows during intense training.",
                            "Connection to Other Joints:",
                            "Issues in the shoulders can affect the elbows, so it's important to maintain joint health across the body."
                        ]
                    ],
                    [
                        "Challenges in Advanced Calisthenics Movements",
                        [
                            "Extreme Positions and Risks:",
                            "Calisthenics movements often place the elbows in extreme positions, which can put muscles and connective tissues under high stress.",
                            "Mechanical Disadvantage:",
                            "Advanced movements can create mechanical disadvantage, increasing the difficulty of positions and movements for the muscles and joints."
                        ]
                    ],
                    [
                        "Strengthening Elbows through Range of Motion",
                        [
                            "Length-Tension Curve:",
                            "As muscles approach extreme ranges of motion, their ability to produce tension decreases, making them weaker in these positions.",
                            "Targeting Lengthened Positions:",
                            "Focus on building strength in the most lengthened positions of the biceps and triceps to minimize injury risk."
                        ]
                    ],
                    [
                        "Forearm and Wrist Conditioning",
                        [
                            "Forearm Muscles Strengthening:",
                            "Strengthen the forearm flexors and extensors in both their lengthened and shortened positions to prevent inner and outer elbow injuries.",
                            "Wrist Pronation and Supination:",
                            "Strengthening wrist rotational movements can improve elbow stability and reduce the risk of injury."
                        ]
                    ],
                    [
                        "Connective Tissue Adaptation",
                        [
                            "Recovery and Adaptation:",
                            "Connective tissues adapt and get stronger with stress, but they take longer to recover than muscles, so proper rest is crucial."
                        ]
                    ],
                    [
                        "Range of Motion Assessment",
                        [
                            "Elbow Range of Motion Check:",
                            "Identify any limitations in elbow extension or flexion, which may result from tight muscles or past injuries.",
                            "Hyperextension Considerations:",
                            "Elbow hyperextension can make you more prone to pain, but strengthening your biceps across all ranges can help protect your joints."
                        ]
                    ],
                    [
                        "Low-Intensity Conditioning Movements",
                        [
                            "Bicep Conditioning:",
                            "Perform bicep exercises like behind-the-back curls, focusing on the most lengthened positions to strengthen the biceps without risking injury.",
                            "Tricep Conditioning:",
                            "For tricep conditioning, focus on exercises that target the most shortened and lengthened positions, like tricep extensions."
                        ]
                    ],
                    [
                        "Advanced Exercises and Testing Elbow Strength",
                        [
                            "Isolation Movements:",
                            "Incorporate exercises like dips, push-ups, and pull-ups to further strengthen the elbows and test their strength in challenging positions.",
                            "Focus on Control:",
                            "Perform these exercises at a low intensity to maintain control and minimize risk, gradually increasing difficulty over time."
                        ]
                    ],
                    [
                        "Conclusion and Routine Summary",
                        [
                            "Personalized Conditioning:",
                            "Tailor your elbow conditioning routine to your individual limitations and training goals for optimal results.",
                            "Rest, Recovery, and Nutrition:",
                            "Incorporate proper rest, recovery, and nutrition to support your elbow conditioning and overall training progress."
                        ]
                    ]
                ]
            }
        ]
    },
    {
        "title": "Steven Low",
        "occupation": "Author of Overcoming Gravity",
        "image": "/images/resource_images/steven-low-landing.jpg",
        "image_about": "/images/resource_images/steven-low-about.jpg",
        "color": "orange",
        "highlighted_about_description": "<span class='font-bold'>Overcoming Gravity</span>, regarded as one of the most comprehensive <span class='font-bold'>calisthenics training manuals</span>. He emphasizes <span class='font-bold'>scientific principles</span> and <span class='font-bold'>structural progressions</span> in his work.",
        "about_description": "Steven Low is a former gymnast and a prominent figure in the calisthenics and bodyweight training world. His book 'Overcoming Gravity' provides a deep dive into the science behind calisthenics training, covering topics such as biomechanics, physiology, and the importance of periodization in workout routines. The book is often lauded for its detailed explanations of progressions for various bodyweight exercises, allowing readers to tailor their training according to their goals and current fitness levels. Steven Low's approach is rooted in scientific research, making his methodologies highly regarded for athletes looking for long-term progress.",
        "description": "Fitness expert and author known for his book Overcoming Gravity, which offers a deep dive into gymnastics-based bodyweight training. His work provides detailed guidance on exercise progressions, programming, and injury prevention, catering to both beginners and advanced practitioners",
        "videos": [
            {
                "title":"Overcoming Gravity Online Introduction",
                "url": "https://www.youtube.com/embed/5L87rA9FKX8",
                "description": "History of the development of the book and Steven Low's background",
                "video_summary": [
                    ["Introduction to Overcoming Gravity", [
                        "About the Author:", "Steven Low is the author of 'Overcoming Gravity', a comprehensive guide on bodyweight strength training.",
                        "Purpose of the Series:", "This video series is meant to go through the book chapter by chapter, serving as a supplemental resource for those who own the book."
                    ]],
                    ["Challenges with Programming", [
                        "Common Questions from Readers:", "Most readers struggle with understanding how to construct workout routines and programming, particularly when dealing with plateaus.",
                        "Focus of the Series:", "The series will help viewers learn to design effective workout routines based on the principles in the book."
                    ]],
                    ["Evolution of Overcoming Gravity", [
                        "First vs Second Edition:", "The first edition had editing errors and lower quality illustrations, while the second edition is a refined version with updated content.",
                        "Importance of Social Media:", "There is now more content available on social media about bodyweight strength movements, but less focus on good programming to achieve them."
                    ]],
                    ["Core Goals of the Book", [
                        "Main Goal:", "The book aims to teach people how to create their own workout routines rather than just giving them pre-made routines.",
                        "Philosophy Behind the Book:", "The adage 'Give a man a fish, and you feed him for a day; teach a man to fish, and you feed him for a lifetime' reflects the book's purpose."
                    ]],
                    ["Five Sections of Overcoming Gravity", [
                        "1. Knowledge Base:", "Covers progressive overload, physiology of strength, hypertrophy, progression charts, shoulder balance, and intro to programming.",
                        "2. Constructing Workout Routines:", "Includes all components of a workout like warm-up, skill work, strength work, and prehab.",
                        "3. Factors Affecting Training:", "Covers factors like endurance, cross-training, overtraining, energy management, and lifestyle considerations such as sleep and nutrition.",
                        "4. Program Implementation:", "Includes examples of beginner, intermediate, and advanced routines, as well as mesocycle planning.",
                        "5. Injury Prevention and Flexibility:", "Discusses common bodyweight training injuries, injury prevention, flexibility, and rehabilitation resources."
                    ]],
                    ["Steven Low’s Background", [
                        "Personal Background:", "Steven was introduced to gymnastics through his father and participated in the sport for several years.",
                        "Overcoming Challenges:", "After suffering injuries that led him to quit, he rediscovered gymnastics and bodyweight strength training later in life."
                    ]],
                    ["Notable Strength Feats", [
                        "Achievements:", "Steven has achieved strength feats such as a 10-second iron cross, dips with 140% body weight, and 8 freestanding handstand push-ups on rings.",
                        "Current Focus:", "Steven's current training focuses on rock climbing, though he still has future strength goals."
                    ]],
                    ["Other Works by Steven Low", [
                        "Additional Books:", "Steven has written 'Overcoming Poor Posture', 'Overcoming Tendonitis', and 'Overcoming Gravity: Advanced Programming'.",
                        "Advanced Programming:", "This e-book focuses on intermediate, advanced, and elite training, particularly on mitigating fatigue and managing workout progressions."
                    ]]
                ]
            },
            {
                "title": "Overcoming Gravity Online Part 01",
                "url": "https://www.youtube.com/embed/ItPZS7qbpQU",
                "description": "Progressive Overload, leverage, and training terminology",
                "video_summary": [
                    ["Introduction to Training Concepts", [
                        "Overview of the Series:", "Steven Low introduces himself as the author of *Overcoming Gravity*, and explains that this series will cover key concepts from the book, starting with fundamental training principles.",
                        "Purpose of Chapter 1:", "The focus is on explaining Progressive Overload, Leverage, common training concepts, and the Repetition Continuum."
                    ]],
                    ["Understanding the SAID Principle", [
                        "SAID Principle:", "The SAID (Specific Adaptation to Imposed Demand) principle refers to the body’s ability to adapt to the specific forces applied to it during resistance training, whether using barbells or bodyweight exercises.",
                        "Application to Muscles and Tissues:", "Not only do muscles adapt, but also surrounding tissues like tendons, ligaments, and joints."
                    ]],
                    ["Progressive Overload", [
                        "Definition of Progressive Overload:", "This concept, introduced by Thomas DeLorme, refers to gradually increasing the stress placed on the body (e.g., by adding weight) to stimulate strength and hypertrophy gains.",
                        "Methods of Overload in Bodyweight Training:", "With bodyweight exercises, overload can be achieved by adjusting exercise difficulty, such as moving from a tuck planche to a full planche or by adding external weight, like a weighted vest."
                    ]],
                    ["Leverage in Bodyweight Exercises", [
                        "Leverage and Torque:", "Low explains how changing the body's shape can increase the force required in exercises. For example, moving from a tuck planche to a full planche increases the torque on the shoulder, making the exercise harder.",
                        "Examples of Leverage:", "Bodyweight exercises like the planche, L-sit, and V-sit require different levels of force depending on the body’s position and center of mass."
                    ]],
                    ["Training at Different Muscle Lengths", [
                        "Range of Motion and Muscle Strength:", "Exercises that work muscles in their full range of motion, especially at longer or shorter lengths, create greater challenges, such as the L-sit, V-sit, and Iron Cross.",
                        "Muscle Strength at Various Ranges:", "Muscles are typically strongest in the middle of their range (e.g., at 90 degrees in a bicep curl), while exercises that challenge the longest or shortest muscle lengths are harder."
                    ]],
                    ["Common Training Concepts", [
                        "Reps and Sets:", "Repetitions (reps) are individual movements, and sets are groups of reps with rest in between. Rest periods should be around 3 minutes for strength and hypertrophy.",
                        "Tempo:", "Tempo refers to the speed of each phase of an exercise, with an example tempo being 1-0-X-0 for push-ups, where the first digit represents the lowering (eccentric) phase and the X represents the explosive (concentric) phase.",
                        "Intensity and Load:", "Intensity is often measured as a percentage of a one-rep max (1RM), with higher percentages correlating to fewer reps. Bodyweight training uses progressions to manipulate load."
                    ]],
                    ["Training Volume and Frequency", [
                        "Volume and Frequency:", "Volume is the total number of sets per muscle group in a workout, while frequency is the number of times a muscle group is trained per week. Beginners typically train three times a week."
                    ]],
                    ["Training to Failure", [
                        "Failure and Reps in Reserve:", "Failure occurs when you can no longer complete another rep with good form. Training near failure (keeping 3-4 reps in reserve) is common for strength and hypertrophy.",
                        "Technical Failure:", "Technical failure is the point where you can no longer perform an exercise with proper technique, which should be avoided in most cases."
                    ]],
                    ["Work Capacity and Deloading", [
                        "Work Capacity:", "Work capacity refers to your ability to handle volume and intensity in training, which increases over time.",
                        "Deloading:", "A planned deload phase involves reducing training intensity, volume, or frequency to recover and allow for supercompensation (increased strength after rest)."
                    ]],
                    ["Plateaus in Training", [
                        "Definition of a Plateau:", "A plateau occurs when progress stalls despite consistent training. Common causes include fatigue, poor sleep, nutrition, or overly aggressive programming.",
                        "Addressing Plateaus:", "Steven Low discusses how to analyze and fix plateaus by adjusting the training plan or external factors like recovery."
                    ]]
                ]
            },
            {
                "title": "Overcoming Gravity Online Part 02",
                "url": "https://www.youtube.com/embed/e4LXUZXBggM",
                "description": "Mastering the Mechanisms of Strength and Hypertrophy Training",
                "video_summary": [
                    ["Introduction to Training Concepts", [
                        "Overview of the Series:", "Steven Low introduces the series based on his book *Overcoming Gravity*, focusing on strength, hypertrophy, and key training principles.",
                        "Topics Covered:", "The video covers strength physiology, hypertrophy, neural adaptations, and open vs. closed chain exercises."
                    ]],
                    ["Understanding Strength", [
                        "Strength Equation:", "Strength is defined as neural adaptations multiplied by hypertrophy (muscle cross-sectional area).",
                        "Importance of Muscle Mass:", "More muscle mass generally increases strength, which is crucial for bodyweight athletes like gymnasts."
                    ]],
                    ["Common Strength Misconceptions", [
                        "Bodyweight and Muscle Mass:", "A misconception in bodyweight training is that staying lighter without adding muscle is beneficial, but top athletes tend to have significant muscle mass for their weight.",
                        "Elite Performers:", "Athletes in weight-based sports like Olympic lifting or wrestling also tend to be highly muscular for their size."
                    ]],
                    ["Muscle Fiber Types", [
                        "Fast-Twitch and Slow-Twitch Fibers:", "Muscles contain high-threshold fast-twitch fibers (Type 2A and 2X) and low-threshold slow-twitch fibers (Type 1).",
                        "Henneman Size Principle:", "Low-threshold motor units are recruited first, followed by high-threshold ones during more intense exercises."
                    ]],
                    ["Neural Adaptations for Strength", [
                        "Motor Unit Recruitment:", "Strength training increases motor unit recruitment, rate coding, and synchronization, all of which contribute to enhanced force production.",
                        "Motor Learning and Antagonist Inhibition:", "Learning specific motor patterns, like pull-ups, increases coordination, and reducing resistance from antagonist muscles (e.g., hamstrings in an L-sit) helps boost performance."
                    ]],
                    ["Central Nervous System and Work Capacity", [
                        "Work Capacity Explained:", "Work capacity refers to the body's ability to handle exercise volume and intensity, which increases over time with training.",
                        "Fatigue and Recovery:", "Recovery strategies like sleep and nutrition replenish CNS capacity, while training takes away from it."
                    ]],
                    ["Mechanisms of Hypertrophy", [
                        "Mechanical Tension:", "Placing high loads on muscles (e.g., through low-rep, heavy training) causes tension that stimulates hypertrophy.",
                        "Muscle Damage:", "Moderate rep ranges (5-12 reps) cause muscle damage during the eccentric phase, leading to growth as the body repairs the damaged tissue.",
                        "Metabolic Stress:", "High-rep training (15+ reps) leads to metabolite accumulation, producing the 'pump' and contributing to muscle growth."
                    ]],
                    ["Myofibrillar vs. Sarcoplasmic Hypertrophy", [
                        "Debate on Hypertrophy Types:", "There is some debate over whether different rep ranges lead to different types of hypertrophy, but in practice, all rep ranges contribute to overall muscle growth.",
                        "Training Practicality:", "For practical purposes, a bigger muscle is a stronger muscle as long as strength training is incorporated."
                    ]],
                    ["Open vs. Closed Chain Exercises", [
                        "Definition of Open and Closed Chain:", "Open chain exercises involve free limb movement (e.g., dumbbell bench press), while closed chain exercises involve fixed limbs (e.g., squats or push-ups).",
                        "Benefits of Closed Chain Exercises:", "Closed and semi-closed chain exercises are better for strength development due to reduced degrees of freedom, focusing energy on major muscle groups."
                    ]],
                    ["CNS Fatigue and Recovery", [
                        "Fatigue from Compound Lifts:", "Heavy compound lifts like deadlifts can cause significant CNS fatigue, leading to the need for variations like rack pulls to avoid overtraining.",
                        "Deloading and Recovery:", "Deload phases reduce volume and intensity, allowing for recovery and further strength gains in future sessions."
                    ]]
                ]
            },
            {
                "title": "Overcoming Gravity Online Part 03",
                "url": "https://www.youtube.com/embed/e4XqxCy3PD4",
                "description": "Overcoming Gravity Gymnastic Progression Charts and Goal Setting",
                "video_summary": [
                    ["Introduction to Overcoming Gravity and Progression Charts", [
                      "Overview:", "Steven Low introduces his book *Overcoming Gravity* and explains the fundamental knowledge base of the progression charts, levels, and goal setting in bodyweight strength training.",
                      "Level Classification:", "The progression system classifies exercises for beginners, intermediates, advanced, and elite levels."
                    ]],
                    ["Progression Charts Origins", [
                      "Federation International of Gymnastics:", "The progression charts are based on the difficulty ratings from the Federation International of Gymnastics (FIG) Men's Artistic Gymnastics (MAG) Code of Points.",
                      "Chart Accessibility:", "These charts became widely available online around the early 2000s, and Steven adapted them for strength progression in bodyweight training."
                    ]],
                    ["Difficulty Levels in Gymnastics", [
                      "FIG Difficulty Levels:", "FIG difficulty ratings range from A to J, with the Overcoming Gravity charts focusing on levels up to C for practical bodyweight training.",
                      "Practical Application:", "Steven adjusted the progressions to make them more applicable to the average person, as elite gymnasts often have genetics and years of training beyond what is feasible for most."
                    ]],
                    ["Progressions and Skill Development", [
                      "Example Progressions:", "Steven demonstrates the pulling chart with various progressions, starting from beginner levels like German Hang and Skin the Cat to advanced moves like the full back lever.",
                      "Training Strategies:", "Progressions help build up strength while avoiding injury, with intermediate steps filling in gaps between harder moves."
                    ]],
                    ["Bodyweight and Strength Considerations", [
                      "Progression Speed:", "Progression speed varies depending on bodyweight, height, and genetics. Shorter and lighter athletes tend to progress faster due to better strength-to-bodyweight ratios.",
                      "Gender Differences:", "Women generally have less upper body strength than men, making certain skills more challenging, though achievable with consistent effort."
                    ]],
                    ["Balancing Pushing and Pulling Movements", [
                      "Common Imbalances:", "Steven notes that many athletes may excel in pulling movements (like front levers) while struggling with pushing movements (like dips), and discusses the risks of muscle imbalances.",
                      "Injury Prevention:", "While imbalances don't necessarily cause injuries, overuse and unpreparedness are key factors that can lead to injury."
                    ]],
                    ["Setting and Achieving Goals", [
                      "Long-term Goals:", "Steven advises setting long-term goals like achieving a front lever, handstand, or one-arm chin-up.",
                      "Short-term Goals:", "Breaking down long-term goals into measurable, realistic short-term steps is key to progressing efficiently."
                    ]],
                    ["SMART Goals Framework", [
                      "Goal Setting Framework:", "Specific, Measurable, Action-oriented, Realistic, and Time-bound (SMART) goals are recommended for progressing through skill levels.",
                      "Progression Cycles:", "Most athletes progress through intermediates in one to three training cycles, depending on their experience and consistency."
                    ]]
                  ]
            }
        ]
    }
]