[
    {
      "name": "Handstand",
      "type": "handstanding",
      "difficulty": 5,
      "image": "/images/skills/handstand.jpg",
      "description": "A handstand is a fundamental skill in gymnastics and calisthenics, involving an inverted position where the practitioner balances on their hands with the body fully extended upwards. Mastery of the handstand demonstrates exceptional strength, control, and balance. Typically, the movement begins by either kicking up into the position or pressing up from a bent-arm position. When performed correctly, the body forms a straight line from the wrists to the toes, requiring perfect alignment and a stable core.",
      "vital_muscles_used": [
        ["Deltoids", "Provide stability in the shoulders and upper arms, crucial for supporting body weight."],
        ["Triceps", "Assist in extending the arms and maintaining elbow lock during the hold."],
        ["Pectorals", "Work synergistically with the shoulders to stabilize the upper body."],
        ["Serratus Anterior", "Engages to keep the shoulder blades protracted, offering a stable base for the handstand."],
        ["Rectus Abdominis and Obliques", "Engage to prevent arching of the back and to maintain a straight body line."],
        ["Gluteus Maximus and Quadriceps", "Help in maintaining hip alignment and straightening the legs during the hold."]
      ],
      "how_to": "To perform a handstand, begin by positioning your hands shoulder-width apart on the ground. Ensure your fingers are spread wide, providing a strong base. From a standing position, kick one leg up into the air while keeping the other leg straight and following closely. Your goal is to bring both legs together vertically above your head. Alternatively, if you have sufficient shoulder and arm strength, you can press into the handstand by pushing up from a bent-arm position.\n\nOnce in the handstand, engage your core muscles to stabilize your midsection and prevent arching. Focus on keeping your head in a neutral position, looking slightly between your hands to help with balance. Your shoulders should be stacked directly above your wrists, with your body forming a straight line. Hold this position for as long as possible, gradually increasing your balance time as you gain strength and control.",
      "muscles": [
        ["Shoulders", "Deltoids", "Rotator Cuffs"],
        ["Arms", "Triceps Brachii"],
        ["Core", "Rectus Abdominis", "Obliques"]
      ],
      "progressions": [
        ["Pyke Pushup", 1],
        ["Decline Pyke Pushup", 2],
        ["Handstand (Wall Asissted)", 4],
        ["Freestand Handstand", 5]
      ]
    },
    {
      "name": "Planche",
      "type": "push",
      "difficulty": 11,
      "image": "/images/skills/Planche.jpg",
      "description": "The planche is a high-level calisthenics and gymnastics skill where the practitioner holds their body parallel to the ground, supported only by their hands. Achieving a planche requires an extraordinary combination of upper body strength, core stability, and balance. Your arms are straight, locked at the elbows, and your body forms a horizontal line from head to toes. The challenge of the planche lies in maintaining this position without allowing your hips to sag or your body to tilt. Training for the planche involves progressive overload, focusing on developing strength in the shoulders, chest, and core, along with practicing specific progressions to build up to the full skill.",
      "muscles_used": [
        ["Pectorals", "Engage to stabilize the upper body and support the forward lean."],
        ["Deltoids", "Provide crucial stability and strength in the shoulders to maintain the hold."],
        ["Triceps", "Assist in extending the arms and locking the elbows."],
        ["Core Muscles", "Including the Rectus Abdominis and Obliques, are essential to keep the body straight and prevent sagging."],
        ["Lower Back", "Helps maintain the body’s straight position by engaging to prevent hyperextension."]
      ],
      "how_to": "Begin training for the planche by first mastering the basic body positions, such as the plank and the hollow body hold. Start in a push-up position with your hands shoulder-width apart. Gradually lean forward, shifting your weight onto your hands while keeping your body straight. Progress through different planche variations, starting with the tuck planche, where your knees are tucked into your chest. As you build strength, advance to more challenging positions, such as the straddle planche, where your legs are spread wide apart, and eventually to the full planche, where your body is fully extended and parallel to the ground.\n\nTo perform the full planche, begin in a tucked position and slowly extend your legs while leaning forward, ensuring that your body remains parallel to the ground. Keep your arms straight and locked at the elbows, with your hands turned slightly outward to reduce strain on your wrists. Engage your core, back, and shoulders to maintain the position, focusing on balance and control. Hold the planche for as long as possible, gradually increasing your hold time as your strength improves.",
      "muscles": [
        ["Back", "Rhomboids", "Levator Scapulae", "Trapezius"],
        ["Arms", "Biceps Brachii", "Triceps Brachii"],
        ["Chest", "Pectorialis Major", "Pectoralis Minor", "Serratus Anterior"],
        ["Shoulders", "Anterior Deltoids", "Anterior Rotator Cuffs"],
        ["Legs", "Quadriceps", "Hamstrings", "Calves"]
      ],
      "progressions": [
        ["Crow Pose", 2],
        ["Frog Stand", 3],
        ["Straight-Arm Frog Stand", 4],
        ["Tuck Planche", 5],
        ["Advanced Tuck Planche", 6],
        ["Pseudo Pushup", 7],
        ["Straddle Planche", 8],
        ["One Leg Planche", 9],
        ["Full Planche", 11],
        ["Straight-Arm Planche to Handstand", 12],
        ["Rings Straight-Arm Straddle Planche to Handstand", 14],
        ["Straight-Arm Straddle Planche to Handstand", 15]
      ]
    },
    {
      "name": "Dragon Squat",
      "type": "leg",
      "difficulty": 7,
      "image": "/images/skills/dragon_squat.jpg",
      "description": "The dragon squat, also known as the dragon pistol squat, is an advanced unilateral leg exercise that involves performing a single-leg squat while the opposite leg is extended behind and around the squatting leg. This movement demands significant balance, strength, and flexibility, particularly in the lower body and core. The dragon squat is a progression beyond the standard pistol squat, adding a rotational element that challenges the stability of the knee, ankle, and hip joints. Proper form is essential to avoid injury and to fully engage the muscles involved.",
      "muscles_used": [
        ["Quadriceps", "Provide the primary force in extending the knee during the squat."],
        ["Glutes", "Stabilize the hips and support the lowering and rising phases of the movement."],
        ["Hamstrings", "Assist in controlling the descent and help with stability in the knee joint."],
        ["Core Muscles", "Engage to maintain balance and control throughout the movement."],
        ["Calves", "Work to stabilize the ankle and foot during the squat."]
      ],
      "how_to": "Start with a basic pistol squat to build the necessary strength and balance. Once you are comfortable with the pistol squat, begin practicing the dragon squat by extending one leg behind and around your supporting leg. Lower your body into a squat, keeping your chest upright and your core engaged. The extended leg should sweep around the back and point diagonally away from the body, adding a rotational challenge to the movement.\n\nFocus on maintaining balance by engaging your core and keeping your knee in line with your toes. Lower yourself as far as possible while keeping control, then push through your heel to return to the starting position. Perform the movement slowly and with control to prevent injury and to fully engage the muscles involved.",
      "muscles": [
        ["Legs", "Quadriceps", "Hamstrings", "Calves"],
        ["Glutes", "Gluteus Maximus", "Gluteus Medius"],
        ["Core", "Rectus Abdominis", "Obliques"]
      ],
      "progressions": [
        ["Squat", 1],
        ["Assisted Pistol Squat", 2],
        ["Pistol Squat", 3],
        ["Elevated Pistol Squat", 4],
        ["Shrimp Squat", 5],
        ["Assisted Dragon Squat", 6], 
        ["Dragon Squat", 7],
        ["Pistol to Dragon Squat", 7],
        ["Weighted Dragon Squat", 8]
      ]
    },
    {
      "name": "Backlever",
      "type": "pull",
      "difficulty": 7,
      "image": "/images/skills/backlever.jpg",
      "description": "The backlever is an advanced gymnastic and calisthenics skill that demonstrates exceptional body control, upper body strength, and core stability. In this move, the body is fully extended horizontally and upside down while the athlete hangs from a bar or rings. The key to achieving the backlever lies in shoulder mobility and total-body tension, particularly in the core, back, and glutes, which work together to maintain a straight line. The skill emphasizes eccentric control and requires building up strength progressively with various easier progressions.",
      "how_to": "Begin by hanging from a bar or gymnastic rings with a shoulder-width grip, palms facing outward. Rotate your body backwards, tucking your legs into your chest, and aim to move your torso parallel to the ground. Start by practicing in the tucked position, gradually extending your legs as you build strength and confidence. To perform the full backlever, maintain a straight line from your head to your toes by engaging your core and back muscles. Ensure that your arms remain straight throughout the movement to reduce shoulder strain. Hold this position for as long as possible, then slowly lower your body back to the starting position. It's crucial to progress slowly and avoid rushing into the full skill to prevent injury.",
      "muscles_used": [
        ["Latissimus Dorsi", "Works to keep the body stable and pull the torso into the inverted position."],
        ["Rhomboids", "Assist in scapular retraction, helping to stabilize the shoulder blades."],
        ["Core Muscles", "Including the Rectus Abdominis, are vital in maintaining a straight body line."],
        ["Glutes and Hamstrings", "Engage to keep the hips extended and prevent the legs from sagging."],
        ["Deltoids", "Shoulders work to stabilize the arms and support body positioning."]
      ],
      "muscles": [
        ["Back", "Latissimus Dorsi", "Rhomboids", "Lower Trapezius"],
        ["Core", "Rectus Abdominis", "Obliques"],
        ["Shoulders", "Deltoids"],
        ["Arms", "Biceps Brachii", "Forearms"],
        ["Legs", "Glutes", "Hamstrings"]
      ],
      "progressions": [
        ["German Hang", 1],
        ["Skin the Cat", 2],
        ["Tuck Backlever", 3],
        ["Advanced Tuck Backlever", 4],
        ["Straddle Backlever", 5],
        ["One Leg Backlever", 6],
        ["Full Backlever", 7], 
        ["Backlever Pullout", 8], 
        ["German Hang Pullout", 9],
        ["Bent Arm Pull-up to Backlever", 10],
        ["Handstand Lower to Backlever", 11]
      ]
    },
    {
      "name": "Manna",
      "type": "push",
      "difficulty": 12,
      "image": "/images/skills/manna.jpg",
      "description": "The manna is one of the most difficult gymnastic skills, requiring an incredible amount of flexibility, core strength, and upper body strength. It involves lifting the legs up and overhead from a seated position while maintaining straight arms and keeping the body in an L-sit position, eventually transitioning into an inverted V-shape where the legs are near or past the head. This skill demands extreme compression and shoulder mobility, making it a long-term goal even for advanced practitioners.",
      "how_to": "Start by mastering the L-sit, which is the foundation for the manna. From an L-sit, push your hips forward and elevate your legs higher than the body while keeping your arms straight. Gradually, aim to bring your legs up and over your torso, towards your head, while maintaining shoulder depression and control. The transition from the L-sit to the manna should be slow and controlled, with the legs remaining straight. As you improve, increase the height of your leg lift and work towards full compression with your legs near or past your head.",
      "muscles_used": [
        ["Shoulders", "Support the body during the push, especially through the anterior deltoids."],
        ["Core Muscles", "Including Rectus Abdominis and Hip Flexors, provide the necessary compression strength to elevate the legs."],
        ["Triceps", "Work to lock the arms and maintain stability."],
        ["Serratus Anterior", "Engages to keep the shoulders depressed and stable."],
        ["Lower Back", "Assists in controlling the elevation and lowering of the legs."]
      ],
      "muscles": [
        ["Shoulders", "Deltoids", "Rotator Cuffs"],
        ["Core", "Rectus Abdominis", "Hip Flexors"],
        ["Arms", "Triceps Brachii"],
        ["Back", "Lower Back"]
      ],
      "progressions": [
        ["L-Sit", 3],
        ["V-Sit", 6],
        ["Manna", 12]
      ]
    },
    {
      "name": "Front Lever",
      "type": "pull",
      "difficulty": 9,
      "image": "/images/skills/front_lever.jpg",
      "description": "The front lever is a static hold performed on gymnastic rings or a pull-up bar where the body is held parallel to the ground with the arms straight and extended down. It demonstrates a high level of core and upper-body strength, particularly in the lats, core, and shoulders. This skill emphasizes total-body tension and is one of the benchmark movements in advanced calisthenics and gymnastics training.",
      "how_to": "To perform the front lever, start by hanging from a pull-up bar or rings with a shoulder-width grip. Engage your core and lats to lift your body upward and tilt your torso backward while maintaining straight arms. Slowly extend your legs out in front of you, keeping your body parallel to the ground. Ensure that your body forms a straight line from your head to your toes by engaging your core and keeping your legs tight. Hold the position for as long as possible while maintaining control, and gradually increase your hold time as your strength improves.",
      "muscles_used": [
        ["Latissimus Dorsi", "Main muscle involved in pulling the torso into position and holding the body stable."],
        ["Core Muscles", "Including Rectus Abdominis, assist in maintaining a straight line."],
        ["Deltoids", "Help stabilize the shoulders and arms."],
        ["Glutes and Hamstrings", "Engage to prevent hip sagging and keep the legs straight."]
      ],
      "muscles": [
        ["Back", "Latissimus Dorsi", "Rhomboids", "Lower Trapezius"],
        ["Core", "Rectus Abdominis", "Obliques"],
        ["Shoulders", "Deltoids"],
        ["Arms", "Biceps Brachii", "Forearms"],
        ["Legs", "Glutes", "Hamstrings"]
      ],
      "progressions": [
        ["Tuck Front Lever", 3],
        ["Advanced Tuck Front Lever", 4],
        ["Straddle Front Lever", 6],
        ["One Leg Front Lever", 7],
        ["Full Front Lever", 9],
        ["Front Lever Pull-ups", 10],
        ["Front Lever to Planche", 11]
      ]
    }
  ]
  